#include <stdio.h>

int main() {
	//Спочатку, встановлюється значення змінної d рівним 1352, а змінні sum та product ініціалізуються значеннями 0 та 1 відповідно. 
		int d = 1352;
	int sum = 0;
	int product = 1;
	//виконується цикл while, який буде продовжуватися, доки d не дорівнюватиме 0

	while (d != 0) {
		//За допомогою оператора % ця остача записується у змінну digit. Далі, ця цифра додається до змінної sum і помножується на змінну product. 
		int digit = d % 10;
		sum += digit;
		product *= digit;
		//У кінці кожної ітерації циклу, число d ділиться на 10, щоб усунути останню оброблену цифру.
		d /= 10;
	}

	printf("Сума цифр: %d\n", sum);
	printf("Добуток цифр: %d\n", product);

	return 0;
}